{
    "NAME": "Fabiano Ammirata",
    "ROLE": "Software Engineer",
    "HOME": {
        "TITLE": "Overview",
        "DESCRIPTION": "Hi! I am a Computer Engineer with interest for DIY, home automation, sustainability, and learning new technologies with the aim of increasing my knowledge. Download the CV at the bottom or take a look at <a href=\"/projects\">projects</a> for more.",
        "CV": {
            "DOWNLOAD": "Download CV",
            "DOWNLOAD_SHORT": "Download",
            "UPTODATE": "Good news! You have the most up-to-date version of resume!",
            "NOT_UPTODATE": "Warning, you have an outdated version of resume."
        }
    },
    "PROJECTS": {
        "TITLE": "Projects",
        "TAGS_LABEL": "Tags:",
        "TECHNOLOGIES_LABEL": "Technologies:",
        "DETAIL": "Project detail",
        "DEMO_URL_LABEL": "DEMO",
        "MEDIA_URL_LABEL": "MEDIA",
        "GITHUB_URL_LABEL": "GITHUB",
        "TAGS": {
            "UNIVERSITY": "University",
            "JOB": "Job",
            "PERSONAL": "Personal",
            "DESIGN": "Work in progress",
            "DEMO": "Demo",
            "GITHUB": "Github",
            "MEDIA": "Media",
            "PAPER": "Paper"
        },
        "TECHNOLOGIES": {
            "HTML": "HTML",
            "CSS": "CSS",
            "SCSS": "SCSS",
            "JAVASCRIPT": "Javascript",
            "TYPESCRIPT": "Typescript",
            "AJAX": "Ajax",
            "JQUERY": "JQuery",
            "JAVA": "Java",
            "JSP": "JSP",
            "SERVLET": "Servlet",
            "MYSQL": "MySQL",
            "OPENGL": "OpenGL",
            "PYTHON": "Python",
            "RASPBERRY": "Raspberry",
            "3DPRINTING": "3D Printing",
            "IONIC": "Ionic",
            "NODEJS": "NodeJS",
            "NODERED": "NodeRED",
            "SUPABASE": "Supabase",
            "GANDALF": "Gandalf",
            "JENKINS": "Jenkins",
            "CONFLUENCE": "Confluence",
            "JIRA": "Jira",
            "BITBUCKET": "Bitbucket",
            "SELENIUM": "Selenium",
            "ANGULAR": "Angular",
            "CORDOVA": "Cordova",
            "CAPACITOR": "Capacitor",
            "DBMEDIA": "DBMedia",
            "WIKIDATA": "WikiData",
            "SPARQL": "SPARQL"
        },
        "PROJECT_TITLE": {
            "1": "Web Dynamic Applications Project - PetsGram",
            "2": "Computer Graphics Project",
            "3": "Robotics Project",
            "4": "Dashboard for Learning Analytics",
            "5": "Platform for querying knowledge bases",
            "6": "Loft Finder Bot",
            "7": "Series of projects for an application in the banking sector",
            "8": "Untivitti",
            "9": "Secret Santa Bot",
            "10": "Custom Survey",
            "11": "Movie Palette",
            "12": "Car Leave Message",
            "13": "Portfolio (this website)",
            "14": "Food Recipes",
            "15": "SostenGo"
        },
        "PROJECT_SUBTITLE": {
            "1": "University project with the aim of creating a small social network where pet owners share photos and connect with others.",
            "2": "University project with the aim of putting into practice the computer graphics notions learned during the study of the subject.",
            "3": "University project with the aim of creating a small robot on wheels by participating in a competition with other teams from the degree course.",
            "4": "Management tool to offer a practical approach to data visualization. Designed for research contexts, it facilitates the analysis of educational data by providing an intuitive platform.",
            "5": "Tool for automatically answering questions using semantic databases by integrating everything with voice assistants and chat bots.",
            "6": "Bot for Telegram that simplifies the search for apartments or houses for rent or sale in Italy, with automatic notifications for new listings.",
            "7": "Mobile app development in the financial sector with agile and incremental methodology. Experience with Ionic Framework, source code management, build automation, and active participation in the project team.",
            "8": "Untivitti is a WebApp developed with Ionic 5 to play the traditional Sicilian Christmas game “Cucù” (also called “Morto” or “Asso che corre\"). The idea was born from the desire to play during the pandemic despite the distance.",
            "9": "Bot to simplify the organization of \"Secret Santa\" groups, facilitating secret combinations of gifts and group communication.",
            "10": "Native web app for creating event polls among friends, allowing you to vote on activities and availability.",
            "11": "Python script to create abstract images with color palettes from famous movies.",
            "12": "WebApp for anonymous communication to report an emergency to the car owner.",
            "13": "Digital version of the curriculum, allowing users to explore their projects and download the latest PDF version.",
            "14": "App to manage recipes, plan weekly meals and automatically generate a shopping list.",
            "15": "Application for the sustainability of own city."
        },
        "PROJECT_DESCRIPTION": {
            "1": "PetsGram is the result of a collaborative effort within a university team of three individuals. In response to the assignment to develop a dynamic web application, we set out to create a unique platform, and thus, PetsGram was born. This specialized social network is designed exclusively for pet owners, providing them with a dedicated space to showcase the adorable moments of their furry companions.<br><br>The concept is simple yet delightful – pet owners can seamlessly upload and share photos of their pets, creating a vibrant community centered around the joys of animal companionship. Beyond mere photo-sharing, PetsGram fosters interaction among pet owners, allowing them to connect, exchange experiences, and form a supportive network.<br><br>Whether it's a heartwarming snapshot of a playful kitten or a majestic photo of a loyal canine companion, PetsGram is the go-to virtual hub for celebrating the diverse and heartening world of pets.",
            "2": "This university project was a concrete opportunity to put into practice the notions learned during the course. The main challenge consisted in modeling a human bust provided by the professor, with the aim of giving emotional expressions. Although we initially encountered some difficulties, with patience and a bit of fun, we managed to overcome them. The decision to add an element of surprise during the exam made the project even more stimulating: we opted for Dragon Ball themed graphics, a cartoon loved by all team members. This choice added creativity and originality to our work, underlining our ability not only to tackle technical challenges, but also to infuse a touch of personality and fun into academic projects.",
            "3": "Our team project aimed to create a small robot capable of autonomously performing various actions within an arena. Among these actions, the recognition of obstacles and the transport of an object from point A to point B stood out. During the exam, the various teams of the study course challenged each other to determine which robot was the best performing and fastest in completing to all assigned tasks. A distinctive element of our robot was the exclusive use of 3D printed parts, giving it an innovative and technologically advanced character.<br><br>Furthermore, the exam was not limited to the competition in the arena, but rather had to carry out actions controlled through a helmet capable of interpreting neural impulses, adding a further level of complexity and innovation to the project. For a more in-depth view of our robot's performance, images and videos are available in the link provided above. This provides a visual overview of the capabilities and creativity implemented in our project, highlighting our commitment to exploring the frontiers of robotics.",
            "4": "During my scholarship period at the CNR, I worked on the aforementioned management tool, developed in Ionic and supported by a backend based on Node.js and Node-RED, represents a practical and flexible solution for data visualization in the field of educational research. The design context focused on the analysis of mobile learning experiences, responding to the growing need to monitor, understand and optimize learning processes mediated by mobile devices.<br><br>The heart of this tool is its interface intuitive, allowing users, both researchers and teachers, to easily explore and interpret educational data. The modular approach based on Node-RED allowed the creation of customized data processing pipelines, providing greater flexibility in adapting to the specific needs of learning contexts.<br><br>Successfully tested in a language course using mobile devices, the tool has proven to be particularly effective in identifying potential situations at risk of student dropout. The visual representation of the data through the traffic light system made the assessment of the risk level immediate, allowing timely and targeted interventions.<br><br>This data management tool is the tangible result of the reflections that emerged from my publications on mobile learning analytics, and the practical implementation in study contexts has contributed to further refining its effectiveness and adaptability.<br><br>This innovation has been applied and tested in the research field in the following two publications:<br><br>Paper presentation for EDULEARN 2019, Palma de Mallorca 1-3 July 2019<br>“Learning Analytics Workflow Management”<br>Fabiano Ammirata, Giovanni Fulantelli, Concetta La Mattina, Davide Taibi<br><br>Paper for EdMedia2019, Amsterdam 24-28 June 2019<br>“A mobile learning analytics tool to foster students' self-reflection”<br>Davide Taibi, Giovanni Fulantelli, Fabiano Ammirata, Concetta La Mattina<br><br>It is possible to consult the complete documents by browsing the link above.",
            "5": "During my scholarship period at the CNR, I focused my research on topics related to Question Answering and the Semantic Web, with specific attention to semantic databases such as DBpedia, WikiData and the use of SPARQL queries. The main objective was to develop innovative tools to interact with these databases in an intelligent and intuitive way.<br><br>In the context of this research, I created a tool aimed at automatically answering questions, exploiting the power of the semantic databases mentioned. The challenge was to create a system that could query these semantic resources efficiently and extract relevant answers. To this end, I implemented integration with voice assistants such as Siri and Google Vocal Assistant, as well as developed a Telegram Bot using Python.<br><br>The key to the success of this project lay in the ability to intelligently interpret the questions asked by users and formulate appropriate queries to the underlying semantic databases. The system had to be able to understand the context of the requests and return meaningful and exhaustive responses.<br><br>This approach not only allowed us to explore the potential of advanced semantic databases, but also contributed to developing automatic response tools which can be integrated with different virtual assistants, making accessing complex information a more intuitive and user-friendly experience.",
            "6": "By exploiting data from the most renowned real estate sites, the bot is able to help those who urgently need to find an apartment. The idea was born from the need to desperately find a home in Milan. Users can apply custom filters, such as location, price range and number of rooms, to refine results and receive automatic notifications of new listings. The bot integrates with Italian real estate sites, guaranteeing always up-to-date information. Developed in Python using the libraries provided by Telegram, with its intuitive interface it offers a pleasant and reassuring user experience during a delicate moment such as that of looking for a home.",
            "7": "During my experience, I dedicated myself to the development of mobile applications in the financial sector, following an agile and incremental methodology. I used the Ionic cross-platform framework (HTML, SCSS, Typescript, Angular, Cordova) to ensure presence on different platforms. I was responsible for source code management and build automation, implementing continuous integration and continuous delivery practices through tools such as Git and Jenkins.<br><br>In the context of project management, I managed defect management and provided active support to the project team, participating in technical discussions and collaborating with the Senior Developer in defining and refining the requirements. I expanded my skills by participating in training courses and obtaining certifications, focusing on new technologies in the backend and cloud computing. I also managed small teams as Senior Developer supporting more junior colleagues.",
            "8": "Untivitti Game App is an Ionic 5-based web application designed to allow people to play the traditional Sicilian Christmas game “Cucù” (also called “Dead” or “Running Ace\"). The concept for the app was born in 2020 during the COVID-19 pandemic, when physical holiday gatherings were limited. The name “Untivitti” lit. “I couldn't see you” captures the essence of play and the spirit of sharing during the Christmas season. The app offers the opportunity to keep Christmas traditions alive by connecting and having fun with friends and family, even from a distance.",
            "9": "Secret Santa Telegram Bot is a Telegram bot developed in Python designed to simplify the organization of \"Secret Santa\" groups. The bot randomly generates secret gift combinations and facilitates group communication, ensuring a fun gift exchange full of surprises. Users can easily invite others to join their \"Secret Santa\" groups, making the organizing experience intuitive and fun.",
            "10": "The native web app was developed using HTML, CSS and JavaScript, offering an intuitive way to create surveys aimed at organizing events with friends. Users can vote on their favorite activities and indicate their availability on the days proposed by the organizer, making it easier to plan fun meetings suitable for all participants.",
            "11": "It is a small Python script designed to generate abstract images using color palettes automatically extracted from images and fragments of famous films.",
            "12": "Intuitive web application developed to facilitate secure communication between passers-by and car owners. The main feature is a QR code displayed on the car's windshield, allowing anyone who notices problems or needs to contact the owner to send messages securely, without revealing the owner's phone number.",
            "13": "Dynamic web application developed with Ionic 7, designed as a digital version of my CV. This app allows users to explore my virtual CV with interactive and engaging content, download the latest version of my CV in PDF format and discover more information about me.",
            "14": "Food Recipes is an app developed in Ionic 6 designed for managing recipes, planning weekly meals and automatically generating shopping lists. The backend is hosted on Supabase cloud.<br><br>It is possible to stay in touch with friends and renowned chefs, follow their latest recipes and share them.<br><br>Work in progress.",
            "15": "Work in progress."
        }
    }
}