{
    "NAME": "Fabiano Ammirata",
    "ROLE": "Ingegnere Informatico",
    "HOME": {
        "TITLE": "Primo piano",
        "DESCRIPTION": "Ciao! Sono un Ingegnere Informatico con interesse per il fai da te, la domotica, la sostenibilità e l'apprendimento di nuove tecnologie con l'obiettivo di ampliare le mie conoscenze. Scarica il curriculum in fondo oppure dai una occhiata ai <a href=\"/projects\">progetti</a> per altro.",
        "CV": {
            "DOWNLOAD": "Scarica il Curriculum",
            "DOWNLOAD_SHORT": "Scarica",
            "UPTODATE": "Buone notizie! Hai la versione più aggiornata del curriculum!",
            "NOT_UPTODATE": "Attenzione, hai una versione datata del curriculum."
        }
    },
    "PROJECTS": {
        "TITLE": "Progetti",
        "TAGS_LABEL": "Tags:",
        "TECHNOLOGIES_LABEL": "Tecnologie:",
        "DETAIL": "Dettaglio progetto",
        "DEMO_URL_LABEL": "DEMO",
        "MEDIA_URL_LABEL": "MEDIA",
        "GITHUB_URL_LABEL": "GITHUB",
        "TAGS": {
            "UNIVERSITY": "Università",
            "JOB": "Lavoro",
            "PERSONAL": "Personale",
            "DESIGN": "In corso",
            "DEMO": "Demo",
            "GITHUB": "Github",
            "MEDIA": "Media",
            "PAPER": "Pubblicazione"
        },
        "TECHNOLOGIES": {
            "HTML": "HTML",
            "CSS": "CSS",
            "SCSS": "SCSS",
            "JAVASCRIPT": "Javascript",
            "TYPESCRIPT": "Typescript",
            "AJAX": "Ajax",
            "JQUERY": "JQuery",
            "JAVA": "Java",
            "JSP": "JSP",
            "SERVLET": "Servlet",
            "MYSQL": "MySQL",
            "OPENGL": "OpenGL",
            "PYTHON": "Python",
            "RASPBERRY": "Raspberry",
            "3DPRINTING": "Stampa 3D",
            "IONIC": "Ionic",
            "NODEJS": "NodeJS",
            "NODERED": "NodeRED",
            "SUPABASE": "Supabase",
            "GANDALF": "Gandalf",
            "JENKINS": "Jenkins",
            "CONFLUENCE": "Confluence",
            "JIRA": "Jira",
            "BITBUCKET": "Bitbucket",
            "SELENIUM": "Selenium",
            "ANGULAR": "Angular",
            "CORDOVA": "Cordova",
            "CAPACITOR": "Capacitor",
            "DBMEDIA": "DBMedia",
            "WIKIDATA": "WikiData",
            "SPARQL": "SPARQL"
        },
        "PROJECT_TITLE": {
            "1": "Progetto di Web Dynamic Applications - PetsGram",
            "2": "Progetto di Computer Grafica",
            "3": "Progetto di Robotica",
            "4": "Piattaforma gestionale in ambito Learning Analytics",
            "5": "Piattaforma per l'interrogazione di basi di conoscenza",
            "6": "Loft Finder Bot",
            "7": "Serie di progetti per una applicazione in ambito bancario",
            "8": "Untivitti",
            "9": "Secret Santa Bot",
            "10": "Custom Survey",
            "11": "Movie Palette",
            "12": "Car Leave Message",
            "13": "Portfolio (questo sito)",
            "14": "Food Recipes",
            "15": "SostenGo"
        },
        "PROJECT_SUBTITLE": {
            "1": "Un piccolo social network in cui i proprietari di animali domestici condividono foto e si connettono con altri appassionati.",
            "2": "Progetto universitario con l'obiettivo di mettere in pratica le nozioni di computer grafica imparate durante lo studio della materia.",
            "3": "Progetto universitario con l'obiettivo di realizzare un piccolo robot su ruote partecipando ad una competizione con altre squadre del corso di laurea.",
            "4": "Strumento di gestione per offrire un approccio pratico alla visualizzazione dati. Progettato per contesti di ricerca, agevola l'analisi di dati educativi, fornendo una piattaforma intuitiva.",
            "5": "Tool per rispondere automaticamente a domande utilizzando database semantici integrando il tutto con assistenti vocali e chat bot.",
            "6": "Bot per Telegram che semplifica la ricerca di appartamenti o case in affitto o vendita in Italia, con notifiche automatiche per nuove inserzioni.",
            "7": "Sviluppo di app mobili nel settore finanziario con metodologia agile e incrementale. Esperienza con Ionic Framework, gestione del codice sorgente, automazione delle build, e partecipazione attiva al team di progetto.",
            "8": "WebApp per giocare al tradizionale gioco natalizio siciliano \"Cucù\".",
            "9": "Bot per semplificare l'organizzazione dei gruppi del \"Secret Santa\", facilitando combinazioni segrete di regali e comunicazione di gruppo.",
            "10": "Web app nativa per la creazione di sondaggi eventi tra amici, permettendo di votare su attività e disponibilità.",
            "11": "Script Python per creare immagini astratte con palette di colori di film famosi.",
            "12": "WebApp per la comunicazione anonima per segnalare un'emergenza al proprietario di auto.",
            "13": "Versione digitale del curriculum, consentendo agli utenti di esplorare i propri progetti e scaricare l'ultima versione in PDF.",
            "14": "App per gestire ricette, pianificare pasti settimanali e generare automaticamente la lista della spesa.",
            "15": "Applicazione per la sostenibilità della propria città."
        },
        "PROJECT_DESCRIPTION": {
            "1": "PetsGram è il risultato di un team universitario di tre persone. In risposta all'incarico di sviluppare un'applicazione web dinamica, abbiamo deciso di creare PetsGram. Questo social network è progettato esclusivamente per i proprietari di animali domestici, fornendo loro uno spazio dedicato per mostrare gli adorabili momenti dei loro compagni pelosi.<br>Il concetto è semplice ma innovativo: i proprietari di animali domestici possono caricare e condividere facilmente foto dei loro animali domestici, creando una vivace comunità incentrata sulle gioie della compagnia degli animali. Oltre alla semplice condivisione di foto, PetsGram favorisce l'interazione tra i proprietari di animali domestici, consentendo loro di connettersi, scambiare esperienze e formare una rete di supporto.<br>Che si tratti di un'istantanea commovente di un gattino giocoso o di una maestosa foto di un fedele compagno canino, PetsGram è l'hub virtuale per mostrare il variegato e incoraggiante mondo degli animali domestici.",
            "2": "Questo progetto universitario è stato un'occasione concreta per mettere in pratica le nozioni apprese durante il corso. La sfida principale consisteva nella modellazione di un busto umano fornito dal professore, con l'obiettivo di conferire espressioni emotive. Sebbene inizialmente abbiamo incontrato alcune difficoltà, con pazienza e un pizzico di divertimento, siamo riusciti a superarle. La decisione di aggiungere un elemento sorpresa durante l'esame ha reso il progetto ancora più stimolante: abbiamo optato per una grafica a tema Dragon Ball, un cartone animato amato da tutti i membri del team. Questa scelta ha aggiunto creatività e originalità al nostro lavoro, sottolineando la nostra capacità non solo di affrontare sfide tecniche, ma anche di infondere un tocco di personalità e divertimento nei progetti accademici.",
            "3": "Il nostro progetto di squadra ha avuto come obiettivo la creazione di un piccolo robot in grado di eseguire autonomamente diverse azioni all'interno di un'arena. Tra queste azioni, spiccavano il riconoscimento degli ostacoli e il trasporto di un oggetto dal punto A al punto B. Durante l'esame, i vari team del corso di studi si sono sfidati per determinare quale robot fosse il più performante e veloce nell'adempire a tutti i compiti assegnati. Un elemento distintivo del nostro robot è stato l'utilizzo esclusivo di parti stampate in 3D, conferendogli un carattere innovativo e tecnologicamente avanzato.<br>L'esame, inoltre, non si è limitato alla competizione in arena, doveva bensì svolgere azioni comandate attraverso un caschetto in grado di interpretare gli impulsi neurali, aggiungendo un livello ulteriore di complessità e innovazione al progetto. Per una visione più approfondita delle prestazioni del nostro robot, sono disponibili immagini e video nel link fornito sopra. Ciò fornisce una panoramica visiva delle capacità e della creatività implementate nel nostro progetto, evidenziando il nostro impegno nell'esplorare le frontiere della robotica.",
            "4": "Durante il mio periodo di borsa di studio presso il CNR, ho lavorato al suddetto tool di gestione, sviluppato in Ionic e supportato da un backend basato su Node.js e Node-RED, rappresenta una soluzione pratica e flessibile per la visualizzazione dei dati nell'ambito della ricerca educativa. Il contesto di progettazione si è concentrato sull'analisi delle esperienze di apprendimento mobile, rispondendo alla crescente necessità di monitorare, comprendere e ottimizzare i processi di apprendimento mediati da dispositivi mobili.<br><br>Il cuore di questo strumento è la sua interfaccia intuitiva, che consente agli utenti, sia ricercatori che docenti, di esplorare e interpretare facilmente i dati educativi. L'approccio modulare basato su Node-RED ha permesso la creazione di pipeline di elaborazione dati personalizzate, fornendo una maggiore flessibilità nell'adattamento alle esigenze specifiche dei contesti di apprendimento.<br><br>Testato con successo in un corso di lingua utilizzando dispositivi mobili, il tool ha dimostrato di essere particolarmente efficace nell'identificare potenziali situazioni a rischio di abbandono degli studenti. La rappresentazione visiva dei dati attraverso il sistema dei semafori ha reso immediata la valutazione del livello di rischio, consentendo interventi tempestivi e mirati.<br><br>Questo strumento di gestione dei dati è il risultato tangibile delle riflessioni emerse dalle mie pubblicazioni sulla mobile learning analytics, e l'implementazione pratica in contesti di studio ha contribuito a raffinare ulteriormente la sua efficacia e adattabilità.<br><br>Questa innovazione è stata applicata e testata in ambito di ricerca nelle seguenti due pubblicazioni:<br><br>Paper presentation for EDULEARN 2019, Palma de Mallorca 1-3 July 2019<br>“Learning Analytics Workflow Management”<br>Fabiano Ammirata, Giovanni Fulantelli, Concetta La Mattina, Davide Taibi<br><br>Paper for EdMedia2019, Amsterdam 24-28 June 2019<br>“A mobile learning analytics tool to foster students’ self-reflection”<br>Davide Taibi, Giovanni Fulantelli, Fabiano Ammirata, Concetta La Mattina<br><br>E' possibile consultare i documenti completi navigando sul link sopra.",
            "5": "Durante il mio periodo di borsa di studio presso il CNR, ho concentrato la mia ricerca su tematiche legate al Question Answering e al Semantic Web, con un'attenzione specifica a database semantici come DBpedia, WikiData e l'utilizzo di query SPARQL. L'obiettivo principale era sviluppare strumenti innovativi per interagire con questi database in modo intelligente e intuitivo.<br><br>Nel contesto di questa ricerca, ho realizzato un tool mirato a rispondere automaticamente a domande, sfruttando la potenza dei database semantici menzionati. La sfida era creare un sistema che potesse interrogare tali risorse semantiche in maniera efficiente ed estrarre risposte pertinenti. A tal fine, ho implementato l'integrazione con assistenti vocali come Siri e Google Vocal Assistant, oltre a sviluppare un Bot Telegram utilizzando Python.<br><br>La chiave del successo di questo progetto risiedeva nella capacità di interpretare in modo intelligente le domande poste dagli utenti e formulare query adeguate ai database semantici sottostanti. Il sistema doveva essere in grado di comprendere il contesto delle richieste e restituire risposte significative ed esaustive.<br><br>Questo approccio non solo ha permesso di esplorare le potenzialità dei database semantici avanzati, ma ha anche contribuito a sviluppare strumenti di risposta automatica che possono essere integrati con diversi assistenti virtuali, rendendo l'accesso a informazioni complesse un'esperienza più intuitiva e user-friendly.",
            "6": "Sfruttando dati provenienti da i più rinomati siti immobiliari, il bot è in grado di aiutare chi ha bisogno urgente di trovare un'appartamento. L'idea è nata dall'esigenza di trovare disperatamente casa a Milano. Gli utenti possono applicare filtri personalizzati, come la posizione, la fascia di prezzo e il numero di stanze, per affinare i risultati e ricevere notifiche automatiche riguardo a nuove inserzioni. Il bot si integra con siti immobiliari italiani, garantendo informazioni sempre aggiornate. Sviluppato in Python sfruttando le librerie fornite da Telegram, con la sua interfaccia intuitiva offre un'esperienza utente piacevole e rassicurante durante un momento delicato come quello  della ricerca di una dimora.",
            "7": "Durante la mia esperienza, mi sono dedicato allo sviluppo di applicazioni mobili nel settore finanziario, seguendo una metodologia agile e incrementale. Ho utilizzato il framework cross-platform Ionic (HTML, SCSS, Typescript, Angular, Cordova) per garantire una presenza su diverse piattaforme. Mi sono occupato della gestione del codice sorgente e dell'automazione delle build, implementando pratiche di continuous integration e continuous delivery tramite strumenti come Git e Jenkins.<br><br>Nel contesto del project management, ho gestito la gestione dei difetti e ho fornito supporto attivo al team di progetto, partecipando a discussioni tecniche e collaborando con il Senior Developer nella definizione e rifinitura dei requisiti. Ho ampliato le mie competenze partecipando a corsi di formazione e ottenendo certificazioni, concentrandomi sulle nuove tecnologie nel backend e nell'ambito del cloud computing. Ho inoltre gestito piccoli team occupando la figura di Senior Developer supportando colleghi più junior.",
            "8": "Untivitti Game App è un'applicazione web basata su Ionic 5 progettata per consentire alle persone di giocare al tradizionale gioco natalizio siciliano \"Cucù\" (detto anche \"Morto\" o \"Asso che corre\"). Il concetto dell'app è nato nel 2020 durante la pandemia di COVID-19, quando le riunioni fisiche durante le festività erano limitate. Il nome \"Untivitti\" lit. \"I couldn't see you\" cattura l'essenza del gioco e lo spirito di condivisione durante il periodo natalizio. L'app offre l'opportunità di mantenere vive le tradizioni natalizie, connettendoti e divertendoti con amici e familiari, anche a distanza.",
            "9": "Secret Santa Telegram Bot è un bot Telegram sviluppato in Python progettato per semplificare l'organizzazione di gruppi del \"Secret Santa\". Il bot genera in modo casuale le combinazioni segrete di regali e agevola la comunicazione di gruppo, garantendo uno scambio di regali divertente e pieno di sorprese. Gli utenti possono facilmente invitare altri a partecipare ai loro gruppi del \"Secret Santa\", rendendo l'esperienza organizzativa intuitiva e divertente.",
            "10": "La web app nativa è stata sviluppata utilizzando HTML, CSS e JavaScript, offrendo un modo intuitivo per creare sondaggi finalizzati all'organizzazione di eventi tra amici. Gli utenti possono votare sulle attività preferite e indicare la propria disponibilità nei giorni proposti dall'organizzatore, facilitando la pianificazione di incontri divertenti e adatti a tutti i partecipanti.",
            "11": "Si tratta di un piccolo script in Python progettato per generare immagini astratte utilizzando le palette di colori estratte automaticamente da immagini e frammenti di celebri film.",
            "12": "Applicazione web intuitiva sviluppata per agevolare la comunicazione sicura tra passanti e proprietari di auto. La caratteristica principale è un QR code visualizzato sul parabrezza dell'auto, consentendo a chiunque noti problemi o debba contattare il proprietario di inviare messaggi in modo sicuro, senza rivelare il numero di telefono del proprietario.",
            "13": "Applicazione web dinamica sviluppata con Ionic 7, pensata come versione digitale del mio Curriculum. Questa app consente agli utenti di esplorare il mio Curriculum virtuale con contenuti interattivi e accattivanti, scaricare l'ultima versione del mio CV in formato PDF e scoprire ulteriori informazioni su di me.",
            "14": "Food Recipes è un'app sviluppata in Ionic 6 progettata per la gestione di ricette, la pianificazione dei pasti settimanali e la generazione automatica delle liste della spesa. Il backend è ospitato su Supabase cloud.<br><br>E' possibile restare in contatto con amici e chef rinomati, seguire le loro ultime ricette e condividerle.<br><br>Sviluppo in corso.",
            "15": "Sviluppo in corso."
        }
    }
}